## Production: lambdas
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 6 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                               NAME                               |
|--------|------------------------------------------------------------------|
| update | `aws_iam_policy.lambda_s3`                                       |
|        | `aws_lambda_function.audit_logs`                                 |
|        | `aws_lambda_function.submission`                                 |
|        | `aws_lambda_function.vault_integrity`                            |
|        | `aws_s3_object.audit_logs_code`                                  |
|        | `aws_s3_object.submission_code`                                  |
| add    | `aws_cloudwatch_event_rule.audit_logs_archiver_lambda_trigger`   |
|        | `aws_cloudwatch_event_target.audit_logs_archiver_lambda_trigger` |
|        | `aws_cloudwatch_log_group.audit_logs_archiver`                   |
|        | `aws_lambda_function.audit_logs_archiver`                        |
|        | `aws_lambda_permission.audit_logs_archiver`                      |
|        | `aws_s3_object.audit_logs_archiver_code`                         |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.audit_logs_archiver_lambda_trigger will be created
  + resource "aws_cloudwatch_event_rule" "audit_logs_archiver_lambda_trigger" {
      + arn                 = (known after apply)
      + description         = "Fires every day at 1am EST"
      + event_bus_name      = "default"
      + id                  = (known after apply)
      + name                = "audit-logs-archiver-lambda-trigger"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 6 * * ? *)"
      + tags_all            = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_cloudwatch_event_target.audit_logs_archiver_lambda_trigger will be created
  + resource "aws_cloudwatch_event_target" "audit_logs_archiver_lambda_trigger" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "audit-logs-archiver-lambda-trigger"
      + target_id      = (known after apply)
    }

  # aws_cloudwatch_log_group.audit_logs_archiver will be created
  + resource "aws_cloudwatch_log_group" "audit_logs_archiver" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = "arn:aws:kms:ca-central-1:957818836222:key/b5973af1-3114-4808-9455-57441c35854d"
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/Audit_Logs_Archiver"
      + name_prefix       = (known after apply)
      + retention_in_days = 731
      + skip_destroy      = false
      + tags_all          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_policy.lambda_s3 will be updated in-place
  ~ resource "aws_iam_policy" "lambda_s3" {
        id          = "arn:aws:iam::957818836222:policy/lambda_s3"
        name        = "lambda_s3"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                          + "arn:aws:s3:::forms-staging-audit-logs-archive-storage/*",
                          + "arn:aws:s3:::forms-staging-audit-logs-archive-storage",
                            "arn:aws:s3:::forms-production-vault-file-storage/*",
                            # (7 unchanged elements hidden)
                        ]
                        # (2 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_lambda_function.audit_logs will be updated in-place
  ~ resource "aws_lambda_function" "audit_logs" {
        id                             = "Audit_Logs"
      ~ last_modified                  = "2024-01-25T16:19:37.000+0000" -> (known after apply)
      ~ s3_object_version              = "3hlR1o6WdUP0F5ZluvO1LG85o.p7NIiO" -> (known after apply)
      ~ source_code_hash               = "Buwqu7thcIBHaO7og80TTG/nf0wASM21hynA9WhHPz0=" -> "uJgR/UkrTb9d9cw3c7/M14DNOgixZp33RJLBUZP3LQ0="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.audit_logs_archiver will be created
  + resource "aws_lambda_function" "audit_logs_archiver" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "Audit_Logs_Archiver"
      + handler                        = "audit_logs_archiver.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::957818836222:role/iam_for_lambda"
      + runtime                        = "nodejs18.x"
      + s3_bucket                      = "forms-production-lambda-code"
      + s3_key                         = "audit_logs_archiver_code"
      + s3_object_version              = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = "j21QkAUTlKxkmkad5xW89Zgl6fwIQ54MWvLhLAnhwdI="
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "AUDIT_LOGS_ARCHIVE_STORAGE_S3_BUCKET" = "forms-staging-audit-logs-archive-storage"
              + "AUDIT_LOGS_DYNAMODB_TABLE_NAME"       = "AuditLogs"
              + "LOCALSTACK"                           = "false"
              + "REGION"                               = "ca-central-1"
            }
        }

      + tracing_config {
          + mode = "PassThrough"
        }
    }

  # aws_lambda_function.submission will be updated in-place
  ~ resource "aws_lambda_function" "submission" {
        id                             = "Submission"
      ~ last_modified                  = "2024-01-25T16:19:37.000+0000" -> (known after apply)
      ~ s3_object_version              = "bBzd3fM7fzihAZKRcPh2x2Eom92FQGQs" -> (known after apply)
      ~ source_code_hash               = "upOHVsX4QZQdq2GJDkBlWCCQTia0Q0WdEVP2ZbhUGXk=" -> "MUixujtBoNJnnkSJ7B6Vthx0gUQCXxS8qA23h6mRcC8="
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.vault_integrity will be updated in-place
  ~ resource "aws_lambda_function" "vault_integrity" {
        id                             = "Vault_Data_Integrity_Check"
      ~ last_modified                  = "2024-02-13T15:11:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "9lDCUtEgnDGaN0b7aU2yhDlM0DDumsUYZhbUsYDuAF4=" -> "TowbMcppnki+0a5fq50Oral3CqleiwGw7U1igvFz0Ws="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_permission.audit_logs_archiver will be created
  + resource "aws_lambda_permission" "audit_logs_archiver" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "Audit_Logs_Archiver"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromCloudWatch"
      + statement_id_prefix = (known after apply)
    }

  # aws_s3_object.audit_logs_archiver_code will be created
  + resource "aws_s3_object" "audit_logs_archiver_code" {
      + acl                    = (known after apply)
      + bucket                 = "forms-production-lambda-code"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "audit_logs_archiver_code"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/tmp/audit_logs_archiver_code.zip"
      + source_hash            = "j21QkAUTlKxkmkad5xW89Zgl6fwIQ54MWvLhLAnhwdI="
      + storage_class          = (known after apply)
      + tags_all               = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + version_id             = (known after apply)
    }

  # aws_s3_object.audit_logs_code will be updated in-place
  ~ resource "aws_s3_object" "audit_logs_code" {
        id                     = "audit_logs_code"
      ~ source_hash            = "Buwqu7thcIBHaO7og80TTG/nf0wASM21hynA9WhHPz0=" -> "uJgR/UkrTb9d9cw3c7/M14DNOgixZp33RJLBUZP3LQ0="
        tags                   = {}
      ~ version_id             = "3hlR1o6WdUP0F5ZluvO1LG85o.p7NIiO" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.submission_code will be updated in-place
  ~ resource "aws_s3_object" "submission_code" {
        id                     = "submission_code"
      ~ source_hash            = "upOHVsX4QZQdq2GJDkBlWCCQTia0Q0WdEVP2ZbhUGXk=" -> "MUixujtBoNJnnkSJ7B6Vthx0gUQCXxS8qA23h6mRcC8="
        tags                   = {}
      ~ version_id             = "bBzd3fM7fzihAZKRcPh2x2Eom92FQGQs" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

Plan: 6 to add, 6 to change, 0 to destroy.

Changes to Outputs:
  + lambda_audit_logs_archiver_group_name            = "/aws/lambda/Audit_Logs_Archiver"

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.audit_logs_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.form_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.nagware_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.reliability_dlq_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.response_archiver_lambda_trigger"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.archive_form_templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.audit_logs_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.dead_letter_queue_consumer"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.nagware"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.reliability"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.response_archiver"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.submission"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.vault_integrity"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_kms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_logging"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_secrets"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.lambda_sqs"]
WARN -...
```

</details>
